Autodesk.Revit.UI.Selection.Selection.GetElementIds
Returns the ids of the elements that are currently selected.
Returns:
The collection containing the ids of the selected elements.

Autodesk.Revit.UI.Selection.Selection.SetElementIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Selects the elements.
Remarks:
This function will select the specified elements and update the UI.
elementIds:
The ids of the elements to be selected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015